deeptienarka/LPC_Paralleling_26Units/Lotus_MasterController_v1/src/CAN_Module/oi_ioCAN.c
/*
 * oi_ioCAN.c
 *
 *  Created on: 16-Mar-2021
 *      Author: OHMLAP0037
 */



#include <oi_can.h>                  // CAN parameters include file
#include "F28x_Project.h"
#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_can.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/can.h"
#include "driverlib/debug.h"
#include "driverlib/interrupt.h"
#include "math.h"
#include "oi_externVariables.h"
#include "oi_genStructureDefs.h"
#include "oi_globalPrototypes.h"
#include "oi_state.h"



void oi_CANA_TX_Event_IO();
void oi_CANA_RX_Event_IO();
void oi_CANA_InitRead_IO();
void Command_IO_Node_Specific_default(int32 nodeID);
void Command_IO_Node_Specific_Purge(int32 nodeID, Uint16 Stage);
void Query_IO_Node_Specific(int32 nodeID);
void Command_IO_Node_Specific_IOPower(int32 nodeID, Uint16 Stage);

void oi_CANA_InitRead_IO()
{
    CanaRead.MBox16 = CAN_readMessage(CANA_BASE, MAILBOX_16, RxMsgData_IO); // Receive Mailbox of AI Block 1 Data
    CanaRead.MBox17 = CAN_readMessage(CANA_BASE, MAILBOX_17, RxMsgData_IO); // Receive Mailbox of AI Block 2 Data
    CanaRead.MBox18 = CAN_readMessage(CANA_BASE, MAILBOX_18, RxMsgData_IO); // Receive Mailbox of Thermocouple Data
    CanaRead.MBox19 = CAN_readMessage(CANA_BASE, MAILBOX_19, RxMsgData_IO); // Receive Mailbox of Generic I/O Data
}

void oi_CANA_TX_Event_IO()
{

    switch (State.Present_St)
    {
    case OI_STAND_BY:

        if(QueryType.IO == IDLE_IO)
        {
            QueryType.IO = DEFAULT;
        }

        else if(QueryType.IO == DEFAULT)
        {
            CANA_timers.TX_count_IO++;

            Command_IO_Node_Specific_default(CAN_LPC_100_NODE); // Command to Set default values to LPC I/O Card

            if(CANA_timers.TX_count_IO > 5)
            {
                CANA_timers.TX_count_IO = 0;

                if(IO_Flags.LPC100_DefaultACK == 1)
                {
                    QueryType.IO = PURGE_FAN1_ON;
                }
                else
                {
                    QueryType.IO = DEFAULT;
                }
            }
        }
        break;

    case OI_PURGE:

        CANA_timers.Time_count_IO_Purge++;

        if (CANA_timers.Time_count_IO_Purge >= 17)
        {
            CANA_timers.Time_count_IO_Purge = 0;

            CANA_timers.Seconds_count_IO_Purge++;
        }

        if (CANA_timers.Seconds_count_IO_Purge >= 60)
        {
            CANA_timers.Minutes_count_IO_Purge++;

            CANA_timers.Seconds_count_IO_Purge = 0;

            CANA_timers.Minutes_flag_IO_Purge = 1;
        }

        if (QueryType.IO == PURGE_FAN1_ON)
        {
            CANA_timers.TX_count_IO++;

            Command_IO_Node_Specific_Purge(CAN_LPC_100_NODE, 1); // Command to turn on purge fans 1 to LPC I/O card

            IO_Flags.PurgeFansON = 1;

            if(CANA_timers.TX_count_IO > 5)
            {
                CANA_timers.TX_count_IO = 0;

                if(IO_Flags.PurgeFan1ON_ACK == 1)
                {
                    QueryType.IO = PURGE_FAN2_ON;
                }
                else
                {
                    QueryType.IO = PURGE_FAN1_ON;
                }
            }
        }

        else if ((CANA_timers.Minutes_count_IO_Purge == 1)
                && (QueryType.IO == PURGE_FAN2_ON))

        {
            CANA_timers.TX_count_IO++;

            Command_IO_Node_Specific_Purge(CAN_LPC_100_NODE, 2); // Command to turn on purge fans 2 to LPC I/O card

            IO_Flags.PurgeFansON = 2;

            if(CANA_timers.TX_count_IO > 5)
            {
                CANA_timers.TX_count_IO = 0;

                if(IO_Flags.PurgeFan2ON_ACK == 1)
                {
                    QueryType.IO = PURGE_FAN3_ON;
                }
                else
                {
                    QueryType.IO = PURGE_FAN2_ON;
                }
            }
        }
        else if ((CANA_timers.Minutes_count_IO_Purge == 2)
                && (QueryType.IO == PURGE_FAN3_ON))
        {
            CANA_timers.TX_count_IO++;

            Command_IO_Node_Specific_Purge(CAN_LPC_100_NODE, 3); // Command to turn on purge fans 3 to LPC I/O card

            IO_Flags.PurgeFansON = 3;

            if(CANA_timers.TX_count_IO > 5)
            {
                CANA_timers.TX_count_IO = 0;

                if(IO_Flags.PurgeFan3ON_ACK == 1)
                {
                    QueryType.IO = AI_BLK1_QUERY;
                }
                else
                {
                    QueryType.IO = PURGE_FAN3_ON;
                }
            }
        }
        else if ((CANA_timers.Minutes_count_IO_Purge == 3)
                && (QueryType.IO == AI_BLK1_QUERY))
        {
            CANA_timers.TX_count_IO++;

            Query_IO_Node_Specific(CAN_LPC_100_NODE); // Query Hydrogen residue with LPC I/O Card

            if(CANA_timers.TX_count_IO > 5)
            {
                CANA_timers.TX_count_IO = 0;

                if((IO_Flags.hydrogenValuesOK == 1)
                        &&(CANA_timers.Seconds_count_IO_Purge >= 40))
                {
                    QueryType.IO = LHC_POWER_ON;
                }
                else
                {
                    QueryType.IO = AI_BLK1_QUERY;
                }
            }
        }

        break;

    case OI_IO_POWER:

        if(QueryType.IO == LHC_POWER_ON)
        {
            CANA_timers.TX_count_IO++;

            Command_IO_Node_Specific_IOPower(CAN_LPC_100_NODE, 1); // Turn ON LHC IO & VS Cards from LPC IO Card

            if(CANA_timers.TX_count_IO > 5)
            {
                CANA_timers.TX_count_IO = 0;

                if(IO_Flags.LHC_POwerON == 1)
                {
                    QueryType.IO = LHC101_DEFAULT;
                }
                else
                {
                    QueryType.IO = LHC_POWER_ON;
                }
            }

        }
        else if (QueryType.IO == LHC101_DEFAULT)
        {
            CANA_timers.TX_count_IO++;

