deeptienarka/LPC_Paralleling_26Units/Lotus_MasterController_v1/src/CAN_Module/oi_ioCAN.c
            Command_IO_Node_Specific_default(CAN_LHC_101_NODE); // Default Set to LHC_101 and Enable level Sensors LVL101 and LVL102

            if(CANA_timers.TX_count_IO > 5)
            {
                CANA_timers.TX_count_IO = 0;

                if(IO_Flags.LHC101_DefaultACK == 1)
                {
                    QueryType.IO = LHC102_DEFAULT;
                }
                else
                {
                    QueryType.IO = LHC101_DEFAULT;
                }

            }
        }
        else if (QueryType.IO == LHC102_DEFAULT)
        {
            CANA_timers.TX_count_IO++;

            Command_IO_Node_Specific_default(CAN_LHC_102_NODE); // Default Set to LHC_102 and Enable LVL401

            if(CANA_timers.TX_count_IO > 5)
            {
                CANA_timers.TX_count_IO = 0;

                if(IO_Flags.LHC102_DefaultACK == 1)
                {
                    QueryType.IO = AI_BLK1_QUERY;
                }
                else
                {
                    QueryType.IO = LHC102_DEFAULT;
                }
            }
        }
        else if (QueryType.IO == AI_BLK1_QUERY)
        {
            CANA_timers.TX_count_IO++;

            if(CANA_timers.TX_count_IO_Query == 0)
            {
                Query_IO_Node_Specific(CAN_LPC_100_NODE); // Query Hydrogen residue with LPC I/O Card
            }
            else if(CANA_timers.TX_count_IO_Query == 1)
            {
                Query_IO_Node_Specific(CAN_LHC_101_NODE); // Query level sensor LVL-101,102 values with LHC_101

            }
            else if(CANA_timers.TX_count_IO_Query == 2)
            {
                Query_IO_Node_Specific(CAN_LHC_102_NODE); // Query level sensor LVL-401 values with LHC_102
            }

            if(CANA_timers.TX_count_IO > 3)
            {
                CANA_timers.TX_count_IO = 0;

                CANA_timers.TX_count_IO_Query++;

                if(CANA_timers.TX_count_IO_Query > 2)
                {
                    CANA_timers.TX_count_IO_Query = 0;
                }

                if(IO_Flags.WaterLevelOk == 1)
                {
                    QueryType.IO = PRT_READ_VFD_ON;

                    CANA_timers.TX_count_IO_Query = 0;
                }
                else
                {
                    QueryType.IO = AI_BLK1_QUERY;
                }
            }
        }
        else if(QueryType.IO == PRT_READ_VFD_ON)
        {
            CANA_timers.TX_count_IO++;

            if(CANA_timers.TX_count_IO_Query == 0)
            {
                Command_IO_Node_Specific_IOPower(CAN_LPC_100_NODE, 2); // Turn ON VFD from LPC card
            }
            else if (CANA_timers.TX_count_IO_Query == 1)
            {
                if(CANA_timers.TX_count_IO_Query2 == 0)
                {
                    Command_IO_Node_Specific_IOPower(CAN_LPC_100_NODE, 3); // Query for LVL-101, LVL-102, PRT-101, PRT-103 values

                    CANA_timers.TX_count_IO_Query2 = 1;
                }
                else if(CANA_timers.TX_count_IO_Query2 == 1)
                {
                    Command_IO_Node_Specific_IOPower(CAN_LHC_101_NODE, 4); // Query for PRT-301 values

                    CANA_timers.TX_count_IO_Query2 = 2;
                }
                else if(CANA_timers.TX_count_IO_Query2 == 2)
                {
                    Command_IO_Node_Specific_IOPower(CAN_LHC_102_NODE, 1); // Query for LVL-401 values

                    CANA_timers.TX_count_IO_Query2 = 0;
                }
            }

            if(CANA_timers.TX_count_IO > 3)
            {
                CANA_timers.TX_count_IO = 0;

                if(IO_Flags.VFD101_ONAck == 1)
                {
                    CANA_timers.TX_count_IO_Query = 1;
                }
            }
        }
    }
}

void oi_CANA_RX_Event_IO()
{
    oi_CANA_InitRead_IO();

    if (CanaRead.MBox16 == 1)
    {
        CAN_readMessage(CANA_BASE, MAILBOX_16, RxMsgData_IO);

        CanaRead.IO_AIBLK1_MSGID = CanaRegs.CAN_IF2ARB.bit.ID;
        CanaRead.IO_AIBLK1_MSGID = CanaRead.IO_AIBLK1_MSGID & CAN_NODEID_MASK;

        CanNode.IOCard_Node = (Uint16) (CanaRead.IO_AIBLK1_MSGID >> 8);

        if (CanNode.IOCard_Node == 1)
        {
            CanNode.IOCard_Type = LPC_100;
        }
        else if (CanNode.IOCard_Node == 2)
        {
            CanNode.IOCard_Type = LHC_101;
        }
        else if (CanNode.IOCard_Node == 3)
        {
            CanNode.IOCard_Type = LHC_102;
        }

        if (CanNode.IOCard_Type == LPC_100)
        {
            AI_Data[LPC_100_NODE].AI0_Data = ((RxMsgData_IO[0] << 8)
                    | (RxMsgData_IO[1])) * 0.001;
            AI_Data[LPC_100_NODE].AI1_Data = ((RxMsgData_IO[2] << 8)
                    | (RxMsgData_IO[3])) * 0.001;
            AI_Data[LPC_100_NODE].AI2_Data = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            AI_Data[LPC_100_NODE].AI3_Data = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;

            AI_SensorData.HYS_101 = AI_Data[LPC_100_NODE].AI0_Data;
            AI_SensorData.HYS_401 = AI_Data[LPC_100_NODE].AI1_Data;
            AI_SensorData.HYS_501 = AI_Data[LPC_100_NODE].AI2_Data;
        }
        else if (CanNode.IOCard_Type == LHC_101)
        {
            AI_Data[LHC_101_NODE].AI0_Data = ((RxMsgData_IO[0] << 8)
                    | (RxMsgData_IO[1])) * 0.001;
            AI_Data[LHC_101_NODE].AI1_Data = ((RxMsgData_IO[2] << 8)
                    | (RxMsgData_IO[3])) * 0.001;
            AI_Data[LHC_101_NODE].AI2_Data = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            AI_Data[LHC_101_NODE].AI3_Data = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;

            AI_SensorData.LVL_101 = AI_Data[LHC_101_NODE].AI0_Data;
            AI_SensorData.LVL_102 = AI_Data[LHC_101_NODE].AI1_Data;
            AI_SensorData.PRT_101 = AI_Data[LHC_101_NODE].AI2_Data;
            AI_SensorData.PRT_103 = AI_Data[LHC_101_NODE].AI3_Data;
        }
        else if (CanNode.IOCard_Type == LHC_102)
        {
            AI_Data[LHC_102_NODE].AI0_Data = ((RxMsgData_IO[0] << 8)
                    | (RxMsgData_IO[1])) * 0.001;
            AI_Data[LHC_102_NODE].AI1_Data = ((RxMsgData_IO[2] << 8)
                    | (RxMsgData_IO[3])) * 0.001;
            AI_Data[LHC_102_NODE].AI2_Data = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            AI_Data[LHC_102_NODE].AI3_Data = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;

            AI_SensorData.LVL_401 = AI_Data[LHC_102_NODE].AI0_Data;
            AI_SensorData.COS_101 = AI_Data[LHC_102_NODE].AI1_Data;
            AI_SensorData.PRT_102 = AI_Data[LHC_102_NODE].AI2_Data;
            AI_SensorData.PRT_103 = AI_Data[LHC_102_NODE].AI3_Data;
        }

