deeptienarka/LPC_Paralleling_26Units/Lotus_MasterController_v1/src/CAN_Module/oi_ioCAN.c
        switch (State.Present_St)
        {

        case OI_PURGE:

            if ((AI_SensorData.HYS_101 <= 7) && (AI_SensorData.HYS_401 <= 7)
                    && (AI_SensorData.HYS_501 <= 7))
            {
                IO_Flags.hydrogenValuesOK = 1;
            }
            else if ((AI_SensorData.HYS_101 >= 7.5)
                    && (AI_SensorData.HYS_401 >= 7.5)
                    && (AI_SensorData.HYS_501 >= 7.5))
            {
                IO_Flags.hydrogenValuesOK = 0;
            }
            break;

        case OI_IO_POWER:

            if ((AI_SensorData.HYS_101 <= 7) && (AI_SensorData.HYS_401 <= 7)
                    && (AI_SensorData.HYS_501 <= 7))
            {
                IO_Flags.hydrogenValuesOK2 = 1;
            }
            else if ((AI_SensorData.HYS_101 >= 7.5)
                    || (AI_SensorData.HYS_401 >= 7.5)
                    || (AI_SensorData.HYS_501 >= 7.5))
            {
                IO_Flags.hydrogenValuesOK2 = 0;
            }

            if ((AI_SensorData.LVL_101 <= 8)
                    || (AI_SensorData.LVL_102 <= 8))
            {
                IO_Flags.WaterLevelOk = 0;
            }
            else if ((AI_SensorData.LVL_101 >= 10.0)
                    && (AI_SensorData.LVL_102 >= 10.0))
            {
                IO_Flags.WaterLevelOk = 1;
            }

            if ((AI_SensorData.PRT_102 >= 12.0)
                    ||(AI_SensorData.PRT_103 >= 12.0)
                    ||(AI_SensorData.PRT_301 >= 5.6))
            {
                IO_Flags.PressureNotOK = 1;
            }

            break;
        }

        CanaRead.MBox16 = 0;
    }
    else if (CanaRead.MBox17 == 1)
    {
        CAN_readMessage(CANA_BASE, MAILBOX_17, RxMsgData_IO);

        CanaRead.IO_AIBLK2_MSGID = CanaRegs.CAN_IF2ARB.bit.ID;
        CanaRead.IO_AIBLK2_MSGID = CanaRead.IO_AIBLK2_MSGID & CAN_NODEID_MASK;

        CanNode.IOCard_Node = (Uint16) (CanaRead.IO_AIBLK2_MSGID >> 8);

        if (CanNode.IOCard_Node == 1)
        {
            CanNode.IOCard_Type = LPC_100;
        }
        else if (CanNode.IOCard_Node == 2)
        {
            CanNode.IOCard_Type = LHC_101;
        }
        else if (CanNode.IOCard_Node == 3)
        {
            CanNode.IOCard_Type = LHC_102;
        }

        if (CanNode.IOCard_Type == LPC_100)
        {
            AI_Data[LPC_100_NODE].AI4_Data = ((RxMsgData_IO[0] << 8)
                    | (RxMsgData_IO[1])) * 0.001;
            AI_Data[LPC_100_NODE].AI5_Data = ((RxMsgData_IO[2] << 8)
                    | (RxMsgData_IO[3])) * 0.001;
            AI_Data[LPC_100_NODE].AI6_Data = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            AI_Data[LPC_100_NODE].AI7_Data = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;
        }
        else if (CanNode.IOCard_Type == LHC_101)
        {
            AI_Data[LHC_101_NODE].AI4_Data = ((RxMsgData_IO[0] << 8)
                    | (RxMsgData_IO[1])) * 0.001;
            AI_Data[LHC_101_NODE].AI5_Data = ((RxMsgData_IO[2] << 8)
                    | (RxMsgData_IO[3])) * 0.001;
            AI_Data[LHC_101_NODE].AI6_Data = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            AI_Data[LHC_101_NODE].AI7_Data = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;
        }
        else if (CanNode.IOCard_Type == LHC_102)
        {
            AI_Data[LHC_102_NODE].AI4_Data = ((RxMsgData_IO[0] << 8)
                    | (RxMsgData_IO[1])) * 0.001;
            AI_Data[LHC_102_NODE].AI5_Data = ((RxMsgData_IO[2] << 8)
                    | (RxMsgData_IO[3])) * 0.001;
            AI_Data[LHC_102_NODE].AI6_Data = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            AI_Data[LHC_102_NODE].AI7_Data = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;
        }

        CanaRead.MBox17 = 0;
    }

    else if (CanaRead.MBox18 == 1)
    {
        CAN_readMessage(CANA_BASE, MAILBOX_18, RxMsgData_IO);

        CanaRead.IO_THERMO_MSGID = CanaRegs.CAN_IF2ARB.bit.ID;
        CanaRead.IO_THERMO_MSGID = CanaRead.IO_THERMO_MSGID & CAN_NODEID_MASK;

        CanNode.IOCard_Node = (Uint16) (CanaRead.IO_THERMO_MSGID >> 8);

        if (CanNode.IOCard_Node == 1)
        {
            CanNode.IOCard_Type = LPC_100;
        }
        else if (CanNode.IOCard_Node == 2)
        {
            CanNode.IOCard_Type = LHC_101;
        }
        else if (CanNode.IOCard_Node == 3)
        {
            CanNode.IOCard_Type = LHC_102;
        }

        if (CanNode.IOCard_Type == LPC_100)
        {
            Thermo_Data[LPC_100_NODE].T0_Data = ((RxMsgData_IO[0] << 8)
                    | (RxMsgData_IO[1])) * 0.001;
            Thermo_Data[LPC_100_NODE].T1_Data = ((RxMsgData_IO[2] << 8)
                    | (RxMsgData_IO[3])) * 0.001;
            Thermo_Data[LPC_100_NODE].T2_Data = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            Thermo_Data[LPC_100_NODE].T3_Data = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;
        }
        else if (CanNode.IOCard_Type == LHC_101)
        {
            Thermo_Data[LHC_101_NODE].T0_Data = ((RxMsgData_IO[0] << 8)
                    | (RxMsgData_IO[1])) * 0.001;
            Thermo_Data[LHC_101_NODE].T1_Data = ((RxMsgData_IO[2] << 8)
                    | (RxMsgData_IO[3])) * 0.001;
            Thermo_Data[LHC_101_NODE].T2_Data = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            Thermo_Data[LHC_101_NODE].T3_Data = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;
        }
        else if (CanNode.IOCard_Type == LHC_102)
        {
            Thermo_Data[LHC_102_NODE].T0_Data = ((RxMsgData_IO[0] << 8)
                    | (RxMsgData_IO[1])) * 0.001;
            Thermo_Data[LHC_102_NODE].T1_Data = ((RxMsgData_IO[2] << 8)
                    | (RxMsgData_IO[3])) * 0.001;
            Thermo_Data[LHC_102_NODE].T2_Data = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            Thermo_Data[LHC_102_NODE].T3_Data = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;
        }

        CanaRead.MBox18 = 0;
    }

    else if (CanaRead.MBox19 == 1)
    {
        CAN_readMessage(CANA_BASE, MAILBOX_19, RxMsgData_IO);

        CanaRead.IO_GENERIC_MSGID = CanaRegs.CAN_IF2ARB.bit.ID;
        CanaRead.IO_GENERIC_MSGID = CanaRead.IO_GENERIC_MSGID & CAN_NODEID_MASK;

        CanNode.IOCard_Node = (Uint16) (CanaRead.IO_GENERIC_MSGID >> 8);

        if (CanNode.IOCard_Node == 1)
        {
            CanNode.IOCard_Type = LPC_100;
        }
        else if (CanNode.IOCard_Node == 2)
        {
            CanNode.IOCard_Type = LHC_101;
        }
        else if (CanNode.IOCard_Node == 3)
        {
            CanNode.IOCard_Type = LHC_102;
        }

        if (CanNode.IOCard_Type == LPC_100)
        {
            IO_DigitalInputRegs[LPC_100_NODE].all = RxMsgData_IO[0];
            IO_DigitalOutputRegs[LPC_100_NODE].all = RxMsgData_IO[1];
            AO_Data[LPC_100_NODE].AO_1 = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            AO_Data[LPC_100_NODE].AO_2 = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;
        }
        else if (CanNode.IOCard_Type == LHC_101)
        {
            IO_DigitalInputRegs[LHC_101_NODE].all = RxMsgData_IO[0];
            IO_DigitalOutputRegs[LHC_101_NODE].all = RxMsgData_IO[1];
            AO_Data[LHC_101_NODE].AO_1 = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            AO_Data[LHC_101_NODE].AO_2 = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;
        }
        else if (CanNode.IOCard_Type == LHC_102)
        {
            IO_DigitalInputRegs[LHC_102_NODE].all = RxMsgData_IO[0];
            IO_DigitalOutputRegs[LHC_102_NODE].all = RxMsgData_IO[1];
            AO_Data[LHC_102_NODE].AO_1 = ((RxMsgData_IO[4] << 8)
                    | (RxMsgData_IO[5])) * 0.001;
            AO_Data[LHC_102_NODE].AO_2 = ((RxMsgData_IO[6] << 8)
                    | (RxMsgData_IO[7])) * 0.001;
        }

