deeptienarka/LPC_Paralleling_26Units/Lotus_MasterController_v1/src/CAN_Module/oi_ioCAN.c
        switch (State.Present_St)
        {

        case OI_STAND_BY:

            if((IO_DigitalInputRegs[LPC_100_NODE].all == 0x00)
                    &&(IO_DigitalOutputRegs[LPC_100_NODE].all == 0x00)
                    &&(AO_Data[LPC_100_NODE].AO_1 == 0x00)
                    &&(AO_Data[LPC_100_NODE].AO_2 == 0x00))
            {
                IO_Flags.LPC100_DefaultACK = 1;
            }
            else
            {
                IO_Flags.LPC100_DefaultACK = 0;
            }


        case OI_PURGE:

            if (IO_Flags.PurgeFansON == 1)
            {
                if (IO_DigitalOutputRegs[LPC_100_NODE].bit.DO_bit0 == 1)
                {
                    IO_Flags.PurgeFan1ON_ACK = 1;
                }
                else
                {
                    IO_Flags.PurgeFan1ON_ACK = 0;
                }
            }
            else if (IO_Flags.PurgeFansON == 2)
            {
                if (IO_DigitalOutputRegs[LPC_100_NODE].bit.DO_bit1 == 1)
                {
                    IO_Flags.PurgeFan2ON_ACK = 1;
                }
                else
                {
                    IO_Flags.PurgeFan2ON_ACK = 0;
                }
            }
            else if (IO_Flags.PurgeFansON == 3)
            {
                if (IO_DigitalOutputRegs[LPC_100_NODE].bit.DO_bit2 == 1)
                {
                    IO_Flags.PurgeFan3ON_ACK = 1;
                }
                else
                {
                    IO_Flags.PurgeFan3ON_ACK = 0;
                }
            }
            break;

        case OI_IO_POWER:

            if (IO_DigitalOutputRegs[LPC_100_NODE].bit.DO_bit6 == 1)
            {
                IO_Flags.LHC_POwerON = 1;
            }
            else
            {
                IO_Flags.LHC_POwerON = 0;
            }

            if ((IO_DigitalOutputRegs[LHC_101_NODE].all == 0)
                    && (IO_DigitalInputRegs[LHC_101_NODE].all == 0)
                    && (IO_SetAnalogInputEnableRegs[LHC_101_NODE].all == 0x03))
            {
                IO_Flags.LHC101_DefaultACK = 1;
            }
            else
            {
                IO_Flags.LHC101_DefaultACK = 0;
            }

            if ((IO_DigitalOutputRegs[LHC_102_NODE].all == 0)
                    && (IO_DigitalInputRegs[LHC_102_NODE].all == 0)
                    && (IO_SetAnalogInputEnableRegs[LHC_102_NODE].all == 0x01))
            {
                IO_Flags.LHC102_DefaultACK = 1;
            }
            else
            {
                IO_Flags.LHC102_DefaultACK = 0;
            }

            if((IO_DigitalOutputRegs[LPC_100_NODE].bit.DO_bit7 == 1)
                    &&(AO_Data[LPC_100_NODE].AO_1 == 1.0))
            {
                IO_Flags.VFD101_ONAck = 1;
            }
            else
            {
                IO_Flags.VFD101_ONAck = 0;
            }

            break;
        }
        CanaRead.MBox19 = 0;
    }
}
void Command_IO_Node_Specific_default(int32 nodeID)
{
    CAN_setupMessageObject(CANA_BASE, MAILBOX_20,
                           (nodeID << 8) | MSG_ID_MODEL_SPECIFIC_QUERY_IO,
                           CAN_MSG_FRAME_EXT, CAN_MSG_OBJ_TYPE_TX, 0x1FFFFFFF,
                           CAN_MSG_OBJ_NO_FLAGS,
                           8);

    if (nodeID == CAN_LPC_100_NODE) // LPC I/O Card Node ID
    {
        Set_AO_Data[LPC_100_NODE].AO_1 = 0;
        Set_AO_Data[LPC_100_NODE].AO_2 = 0;

        IO_SetDigitalOutputRegs[LPC_100_NODE].all = DEFAULT_SETDO_LPC_100;
        IO_SetAnalogInputEnableRegs[LPC_100_NODE].all = DEFAULT_SETAI_LPC_100;

        IO_SetAnalogInputEnableRegs[LPC_100_NODE].all = 0x07; // Enable Analog Inputs

        txMsgData[0] = IO_COMMAND_QUERY_GENERIC;
        txMsgData[1] = IO_DO_SET;
        txMsgData[2] = IO_SetDigitalOutputRegs[LPC_100_NODE].all;  // Default
        txMsgData[3] = IO_SetAnalogInputEnableRegs[LPC_100_NODE].all;
        txMsgData[4] = (Set_AO_Data[LPC_100_NODE].AO_1 << 8);
        txMsgData[5] = (Set_AO_Data[LPC_100_NODE].AO_1 & 0xFF);
        txMsgData[6] = (Set_AO_Data[LPC_100_NODE].AO_2 << 8);
        txMsgData[7] = (Set_AO_Data[LPC_100_NODE].AO_2 & 0xFF);
    }
    else if (nodeID == CAN_LHC_101_NODE)
    {
        Set_AO_Data[LHC_101_NODE].AO_1 = 0;
        Set_AO_Data[LHC_101_NODE].AO_2 = 0;

        IO_SetDigitalOutputRegs[LHC_101_NODE].all = DEFAULT_SETDO_LHC_101;
        IO_SetAnalogInputEnableRegs[LHC_101_NODE].all = DEFAULT_SETAI_LHC_101;

        IO_SetAnalogInputEnableRegs[LHC_101_NODE].bit.AI_EN_bit0 = 1;
        IO_SetAnalogInputEnableRegs[LHC_101_NODE].bit.AI_EN_bit1 = 1; // Enable Level Sensors LVL101 and LVL102

        txMsgData[0] = IO_COMMAND_QUERY_GENERIC;
        txMsgData[1] = IO_DO_SET;
        txMsgData[2] = IO_SetDigitalOutputRegs[LHC_101_NODE].all;
        txMsgData[3] = IO_SetAnalogInputEnableRegs[LHC_101_NODE].all;
        txMsgData[4] = (Set_AO_Data[LHC_101_NODE].AO_1 << 8);
        txMsgData[5] = (Set_AO_Data[LHC_101_NODE].AO_1 & 0xFF);
        txMsgData[6] = (Set_AO_Data[LHC_101_NODE].AO_2 << 8);
        txMsgData[7] = (Set_AO_Data[LHC_101_NODE].AO_2 & 0xFF);
    }
    else if (nodeID == CAN_LHC_102_NODE)
    {
        Set_AO_Data[LHC_102_NODE].AO_1 = 0;
        Set_AO_Data[LHC_102_NODE].AO_2 = 0;

        IO_SetDigitalOutputRegs[LHC_102_NODE].all = DEFAULT_SETDO_LHC_102;
        IO_SetAnalogInputEnableRegs[LHC_102_NODE].all = DEFAULT_SETAI_LHC_102;

        IO_SetAnalogInputEnableRegs[LHC_102_NODE].bit.AI_EN_bit0 = 1; // Enable Level Sensors LVL401

        txMsgData[0] = IO_COMMAND_QUERY_GENERIC;
        txMsgData[1] = IO_DO_SET;
        txMsgData[2] = IO_SetDigitalOutputRegs[LHC_102_NODE].all;
        txMsgData[3] = IO_SetAnalogInputEnableRegs[LHC_102_NODE].all;
        txMsgData[4] = (Set_AO_Data[LHC_102_NODE].AO_1 << 8);
        txMsgData[5] = (Set_AO_Data[LHC_102_NODE].AO_1 & 0xFF);
        txMsgData[6] = (Set_AO_Data[LHC_102_NODE].AO_2 << 8);
        txMsgData[7] = (Set_AO_Data[LHC_102_NODE].AO_2 & 0xFF);
    }

    CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);
}

void Command_IO_Node_Specific_Purge(int32 nodeID, Uint16 Stage)
{

    CAN_setupMessageObject(CANA_BASE, MAILBOX_20,
                           (nodeID << 8) | MSG_ID_MODEL_SPECIFIC_QUERY_IO,
                           CAN_MSG_FRAME_EXT, CAN_MSG_OBJ_TYPE_TX, 0x1FFFFFFF,
                           CAN_MSG_OBJ_NO_FLAGS,
                           8);

    IO_SetDigitalOutputRegs[LPC_100_NODE].all = 0;

    if (nodeID == CAN_LPC_100_NODE) // LPC I/O Card Node ID
    {
        if (Stage == 1)
        {
            Set_AO_Data[LPC_100_NODE].AO_1 = 0;
            Set_AO_Data[LPC_100_NODE].AO_2 = 0;

