deeptienarka/LPC_Paralleling_26Units/Lotus_MasterController_v1/src/CAN_Module/oi_ioCAN.c
            IO_SetDigitalOutputRegs[LPC_100_NODE].bit.DO_bit0 = 1; // Turn ON Purge Fans 1

            txMsgData[0] = IO_COMMAND_QUERY_GENERIC;
            txMsgData[1] = IO_DO_SET;
            txMsgData[2] = IO_SetDigitalOutputRegs[LPC_100_NODE].all; // LPC Purge Fans ON DO_0 and DO_1 high
            txMsgData[3] = IO_SetAnalogInputEnableRegs[LPC_100_NODE].all;
            txMsgData[4] = (Set_AO_Data[LPC_100_NODE].AO_1 << 8);
            txMsgData[5] = (Set_AO_Data[LPC_100_NODE].AO_1 & 0xFF);
            txMsgData[6] = (Set_AO_Data[LPC_100_NODE].AO_2 << 8);
            txMsgData[7] = (Set_AO_Data[LPC_100_NODE].AO_2 & 0xFF);
        }
        else if (Stage == 2)
        {
            IO_SetDigitalOutputRegs[LPC_100_NODE].bit.DO_bit1 = 1; // Turn ON Purge Fans 2

            txMsgData[0] = IO_COMMAND_QUERY_GENERIC;
            txMsgData[1] = IO_DO_SET;
            txMsgData[2] = IO_SetDigitalOutputRegs[LPC_100_NODE].all; // LPC Purge Fans ON DO_0 and DO_1 high
            txMsgData[3] = IO_SetAnalogInputEnableRegs[LPC_100_NODE].all;
            txMsgData[4] = (Set_AO_Data[LPC_100_NODE].AO_1 << 8);
            txMsgData[5] = (Set_AO_Data[LPC_100_NODE].AO_1 & 0xFF);
            txMsgData[6] = (Set_AO_Data[LPC_100_NODE].AO_2 << 8);
            txMsgData[7] = (Set_AO_Data[LPC_100_NODE].AO_2 & 0xFF);
        }
        else if (Stage == 3)
        {
            IO_SetDigitalOutputRegs[LPC_100_NODE].bit.DO_bit2 = 1; // Turn ON Purge Fans 3

            txMsgData[0] = IO_COMMAND_QUERY_GENERIC;
            txMsgData[1] = IO_DO_SET;
            txMsgData[2] = IO_SetDigitalOutputRegs[LPC_100_NODE].all; // LPC Purge Fans ON DO_0 and DO_1 high
            txMsgData[3] = IO_SetAnalogInputEnableRegs[LPC_100_NODE].all;
            txMsgData[4] = (Set_AO_Data[LPC_100_NODE].AO_1 << 8);
            txMsgData[5] = (Set_AO_Data[LPC_100_NODE].AO_1 & 0xFF);
            txMsgData[6] = (Set_AO_Data[LPC_100_NODE].AO_2 << 8);
            txMsgData[7] = (Set_AO_Data[LPC_100_NODE].AO_2 & 0xFF);
        }
    }

    CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);
}

void Query_IO_Node_Specific(int32 nodeID)
{
    Uint16 Query_No;

    CAN_setupMessageObject(CANA_BASE, MAILBOX_20,
                           (nodeID << 8) | MSG_ID_MODEL_SPECIFIC_QUERY_IO,
                           CAN_MSG_FRAME_EXT, CAN_MSG_OBJ_TYPE_TX, 0x1FFFFFFF,
                           CAN_MSG_OBJ_NO_FLAGS,
                           8);

    if (QueryType.IO == AI_BLK1_QUERY)
    {
        Query_No = IO_QUERY_AIBLK1;
    }
    else if (QueryType.IO == AI_BLK2_QUERY)
    {
        Query_No = IO_QUERY_AIBLK2;
    }
    else if (QueryType.IO == THERMO_QUERY)
    {
        Query_No = IO_QUERY_THERMO;
    }
    else if (QueryType.IO == GENERIC_QUERY)
    {
        Query_No = IO_QUERY_GENERIC;
    }

    txMsgData[0] = IO_GENERAL_QUERY;
    txMsgData[1] = Query_No;
    txMsgData[2] = 0x0;
    txMsgData[3] = 0x0;
    txMsgData[4] = 0x0;
    txMsgData[5] = 0x0;
    txMsgData[6] = 0x0;
    txMsgData[7] = 0x0;

    CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);

}

void Command_IO_Node_Specific_IOPower(int32 nodeID, Uint16 Stage)
{

    CAN_setupMessageObject(CANA_BASE, MAILBOX_20,
                           (nodeID << 8) | MSG_ID_MODEL_SPECIFIC_QUERY_IO,
                           CAN_MSG_FRAME_EXT, CAN_MSG_OBJ_TYPE_TX, 0x1FFFFFFF,
                           CAN_MSG_OBJ_NO_FLAGS,
                           8);

    if (nodeID == CAN_LPC_100_NODE) // LPC I/O Card Node ID
    {
        if (Stage == 1)
        {
            Set_AO_Data[LPC_100_NODE].AO_1 = 0;
            Set_AO_Data[LPC_100_NODE].AO_2 = 0;

            IO_SetDigitalOutputRegs[LPC_100_NODE].all = 0;
            IO_SetAnalogInputEnableRegs[LPC_100_NODE].all = 0;

            IO_SetDigitalOutputRegs[LPC_100_NODE].bit.DO_bit6 = 1; // Turn On Relay to power LHC I/O & VS Cards

            txMsgData[0] = IO_COMMAND_QUERY_GENERIC;
            txMsgData[1] = IO_DO_SET;
            txMsgData[2] = IO_SetDigitalOutputRegs[LPC_100_NODE].all;
            txMsgData[3] = IO_SetAnalogInputEnableRegs[LPC_100_NODE].all;
            txMsgData[4] = (Set_AO_Data[LPC_100_NODE].AO_1 << 8);
            txMsgData[5] = (Set_AO_Data[LPC_100_NODE].AO_1 & 0xFF);
            txMsgData[6] = (Set_AO_Data[LPC_100_NODE].AO_2 << 8);
            txMsgData[7] = (Set_AO_Data[LPC_100_NODE].AO_2 & 0xFF);

            CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);
        }
        else if (Stage == 2)
        {

            IO_SetDigitalOutputRegs[LPC_100_NODE].all = 0;
            IO_SetAnalogInputEnableRegs[LPC_100_NODE].all = 0;

            IO_SetDigitalOutputRegs[LPC_100_NODE].bit.DO_bit7 = 1; // Turn ON VFD Relay

            Set_AO_Data[LPC_100_NODE].AO_1 = 1.0; // 1V corresponds to 10Hz in VFD
            Set_AO_Data[LPC_100_NODE].AO_2 = 0;

            txMsgData[0] = IO_COMMAND_QUERY_GENERIC;
            txMsgData[1] = IO_DO_SET;
            txMsgData[2] = IO_SetDigitalOutputRegs[LPC_100_NODE].all; // Turn On power to LHC IO Card Do_5 High
            txMsgData[3] = IO_SetAnalogInputEnableRegs[LPC_100_NODE].all;
            txMsgData[4] = (Set_AO_Data[LPC_100_NODE].AO_1 << 8);
            txMsgData[5] = (Set_AO_Data[LPC_100_NODE].AO_1 & 0xFF);
            txMsgData[6] = (Set_AO_Data[LPC_100_NODE].AO_2 << 8);
            txMsgData[7] = (Set_AO_Data[LPC_100_NODE].AO_2 & 0xFF);

            CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);
        }
        else if(Stage == 3)
        {
            txMsgData[0] = IO_GENERAL_QUERY;
            txMsgData[1] = IO_COMMAND_QUERY_GENERIC;
            txMsgData[2] = 0x00;
            txMsgData[3] = 0x00;
            txMsgData[4] = 0x00;
            txMsgData[5] = 0x00;
            txMsgData[6] = 0x00;
            txMsgData[7] = 0x00;

            CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);
        }

    }
    else if (nodeID == CAN_LHC_101_NODE)
    {
        if (Stage == 1)
        {
            Set_AO_Data[LHC_101_NODE].AO_1 = 0;
            Set_AO_Data[LHC_101_NODE].AO_2 = 0;

            IO_SetAnalogInputEnableRegs[LHC_101_NODE].all = 0;
            IO_SetDigitalOutputRegs[LHC_101_NODE].all = 0;

            IO_SetAnalogInputEnableRegs[LHC_101_NODE].bit.AI_EN_bit0 = 1; // Enable LVL 101
            IO_SetAnalogInputEnableRegs[LHC_101_NODE].bit.AI_EN_bit1 = 1; // Enable LVL 102


            txMsgData[0] = IO_COMMAND_QUERY_GENERIC;
            txMsgData[1] = IO_DO_SET;
            txMsgData[2] = IO_SetDigitalOutputRegs[LPC_100_NODE].all;
            txMsgData[3] = IO_SetAnalogInputEnableRegs[LPC_100_NODE].all;
            txMsgData[4] = (Set_AO_Data[LHC_101_NODE].AO_1 << 8);
            txMsgData[5] = (Set_AO_Data[LHC_101_NODE].AO_1 & 0xFF);
            txMsgData[6] = (Set_AO_Data[LHC_101_NODE].AO_2 << 8);
            txMsgData[7] = (Set_AO_Data[LHC_101_NODE].AO_2 & 0xFF);

            CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);
        }
        else if (Stage == 2)
        {
            Set_AO_Data[LHC_101_NODE].AO_1 = 0;
            Set_AO_Data[LHC_101_NODE].AO_2 = 0;

            IO_SetAnalogInputEnableRegs[LHC_101_NODE].all = 0;
            IO_SetDigitalOutputRegs[LHC_101_NODE].all = 0;

            IO_SetAnalogInputEnableRegs[LHC_101_NODE].bit.AI_EN_bit2 = 1;  // Enable PRT 101
            IO_SetAnalogInputEnableRegs[LHC_101_NODE].bit.AI_EN_bit3 = 1;  // Enable PRT 103
            IO_SetAnalogInputEnableRegs[LHC_101_NODE].bit.AI_EN_bit4 = 1;  // Enable PRT 301

            txMsgData[0] = IO_COMMAND_QUERY_AIBLK1;
            txMsgData[1] = IO_DONTCARE;
            txMsgData[2] = IO_SetDigitalOutputRegs[LPC_100_NODE].all;
            txMsgData[3] = IO_SetAnalogInputEnableRegs[LPC_100_NODE].all;
            txMsgData[4] = (Set_AO_Data[LHC_101_NODE].AO_1 << 8);
            txMsgData[5] = (Set_AO_Data[LHC_101_NODE].AO_1 & 0xFF);
            txMsgData[6] = (Set_AO_Data[LHC_101_NODE].AO_2 << 8);
            txMsgData[7] = (Set_AO_Data[LHC_101_NODE].AO_2 & 0xFF);

            CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);
        }
        else if (Stage == 3)
        {
            txMsgData[0] = IO_GENERAL_QUERY;
            txMsgData[1] = IO_COMMAND_QUERY_AIBLK1;
            txMsgData[2] = 0x00;
            txMsgData[3] = 0x00;
            txMsgData[4] = 0x00;
            txMsgData[5] = 0x00;
            txMsgData[6] = 0x00;
            txMsgData[7] = 0x00;

            CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);
        }
        else if (Stage == 4)
        {
            txMsgData[0] = IO_GENERAL_QUERY;
            txMsgData[1] = IO_COMMAND_QUERY_AIBLK2;
            txMsgData[2] = 0x00;
            txMsgData[3] = 0x00;
            txMsgData[4] = 0x00;
            txMsgData[5] = 0x00;
            txMsgData[6] = 0x00;
            txMsgData[7] = 0x00;

            CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);
        }
    }
    else if (nodeID == CAN_LHC_102_NODE)
    {
        if (Stage == 1)
        {
            txMsgData[0] = IO_GENERAL_QUERY;
            txMsgData[1] = IO_COMMAND_QUERY_AIBLK1;
            txMsgData[2] = 0x00;
            txMsgData[3] = 0x00;
            txMsgData[4] = 0x00;
            txMsgData[5] = 0x00;
            txMsgData[6] = 0x00;
            txMsgData[7] = 0x00;

            CAN_sendMessage(CANA_BASE, MAILBOX_20, 8, txMsgData);
        }
    }
}
